<template>
  <Context icon="flfg.svg" name="法规查询">
    <div class="text-white leading-[50px]" v-for="(item, key) in data[v].content" :key="key">
      <div class="text-[30px] my-[20px]">{{ item.title }}</div>
      <div class="text-[20px]" v-html="item.text"></div>
    </div>
  </Context>
</template>
<script lang="ts" setup>
import Context from '@/components/Context.vue'

import { useRoute } from 'vue-router'
import { useTitleStore } from '@/store/title.ts'

const useTitle = useTitleStore()
const route = useRoute()
const v = route.query.v as keyof typeof data

const data = {
  aqzy: {
    title: '安全作业',
    content: [
      {
        title: '《江苏海事局海上风电通航安全监督管理规定》',
        text: `<li>海上风电场应当与航道、航路、锚地、船舶定线区、船舶报告区、安全作业区等海上交通功能区域保持安全距离。</li>
             <li>海上风电场选址和海底电缆路由应当充分考虑周围通航环境，结合船舶交通流量、特点等进行通航安全专题研究，确定通航安全保障措施。</li>
             <li>海上风电场风机总体布置应当满足施工期船机设备和运维船的通航安全要求。</li>
             <li>海上风电海底电缆管线应当合理设计埋深，不得穿越锚地。电缆管线确需穿越航道、航路、船舶定线区等海上交通功能区域的，应当进行专题研究，采取有效措施，确保通航安全。</li>
             <li>海上风电场应当避免对船舶交通管理系统（VTS）和过往船舶导助航系统造成影响。确实难以避免造成影响的，应当开展专题研究，配备必要的设施以消除不利影响。</li>
             <li>严禁船舶超定额载客、超抗风等级或能见度标准航行。确因特殊情况需要夜间载运人员出海的，应当满足法定夜间航行安全要求。</li>
             <li>建设、业主（管理）、施工、运维单位应当落实安全生产主体责任，对出海人员实施分类管理，明确和细化船员、海上风电作业人员、临时性出海人员的管理要求。</li>
             <li>船员应当持有符合《中华人民共和国船员条例》所要求的相应证书，熟悉附近水域通航环境，及时关注风电场及其附近水域气象、水文、航行通（警）告等情况。起重船、安装平台、铺缆船等非自航工程船舶应当根据《江苏海事局辖区非自航船舶安全配员最低标准（试行）》配备具有一定风电施工和应急处置经验的持证船员。海上风电作业人员应当参加海上交通安全技能培训并取得相关培训证明，出海前接受安全教育，确保掌握海上救生消防基本知识，熟悉作业区域的气象海况、工况条件和安全要求等。临时性出海人员出海前应当接受安全教育，通过阅读资料、观看视频等方式掌握必要的安全和救生知识。所有出海人员出海前必须检查和佩戴好相关的救护、照明、通讯等个人防护用品。鼓励佩戴具有定位和报警功能的电子设备。出海人员应当从符合安全要求的登乘点集中登乘。</li>
             <li>建设、业主（管理）、施工、运维单位应当落实船舶（人员）出海卡口责任，建立出海人员登记制度，明确专人负责，登记出海人员数量、姓名、出海时间、返回时间等信息，相关记录备查。</li>
             <li>船舶应当持有法定证书、文书，满足船舶最低安全配员要求，配备相应的救生、消防、通信和防污染等设施设备，在其证书载明的航区内航行、停泊和作业，严格按照核定的船舶种类从事相关作业，不得混作他用。非自航船舶应当根据应急需求配备相应的锚、锚链和锚机。运维船舶根据安全需要配备登乘软梯等辅助设施。船舶应当遵守进出港报告等制度。从事风电塔筒、管桩、风叶等设备和砂石料运输的船舶进、出场前应当向海事管理机构报告船舶动态。风电运维船舶应当在开航前做好安全自查，对于在固定航线航行且单次航程不超过2小时的，一日内应当至少自查一次；对超过2小时的，每个航次前应当进行自查，并做好记录。所有船舶应当配备船舶自动识别系统，确保随时处于正常工作状态。配齐必要的航海图书资料（非自航船舶除外），正确显示号灯号型，保持甚高频值守。严禁船舶超定额载客、超抗风等级或能见度标准航行。确因特殊情况需要夜间载运人员出海的，应当满足法定夜间航行安全要求。所有船舶不得携带渔网、渔具等与风电施工、运维无关的工具，不得从事捕捞、垂钓、旅游观光等与风电施工、运维无关的作业活动。</li>
             <li>建设、业主（管理）单位应当建设集合船舶自动识别系统、甚高频通信系统、水文气象信息采集系统、视频监控系统和网络传输系统等基础设施的海上风电企业自主监控平台，加强海上风电通航安全自主监控，实时掌握现场海况，对作业船舶和人员动态实行监控、预警和处置。鼓励建设、业主（管理）单位通过组建联盟的方式对风电运维船舶实施公司化管理，风电运维船舶公司应当全面落实安全生产主体责任，加强自有或所管船舶的安全管理，建立健全安全与防污染管理制度，制定相关应急预案，加大安全生产投入力度，不断提升公司管理水平。建设、业主（管理）、施工、运维单位应当建立船舶调度制度，合理编排船舶出海计划，及时将出海船舶和人员出海计划录入海上风电企业自主监控平台，通过运用自主监控平台，加强对出海船舶和人员动态管控、预警和自主管理。建设、业主（管理）、施工、运维单位应当明确船舶靠泊码头、人员登乘码头、避风水域等，合理确定船舶进出风电场的固定路线。人员登乘码头管理单位应当配备船舶靠离泊、人员上下所需的安全设施，建立相关管理制度。</li>
`
      },
      {
        title: '《上海海事局海上风电场海上交通安全管理规定》',
        text: `<li>业主单位在招投标前应明确参与海上风电场施工作业的船舶、海上设施的安全标准和条件，在招投标后督促施工单位落实；施工期间明确安全责任人，加强安全管理，落实海上交通安全要求、通航安全保障、防污染措施；保证海上交通安全设施与海上风电场主体工程同时设计、施工、投入生产与使用；风电场建成后，通航安全有关参数报主管机关备案；承担运维的安全生产主体责任，建立健全运维作业安全责任制和安全生产规章制度。</li>
             <li>施工单位应依法办理施工作业许可手续，申请安全作业区，保证参与施工作业的船舶、海上设施适航且适于从事施工状态，船员适任；制定通航安全保障方案，在设立的安全作业区内施工，将所有相关的设施、船舶、人员纳入海上交通安全管理体系，并签订安全协议。</li>
             <li>运维单位应依法为海上风电场出海作业的运维人员投保安全生产责任险；编制运维规程、日常巡视制度、特殊巡视制度，加强风电场运行监控和专用航标、风机基础等设备设施的检查；建立多种情况下应急预案，定期组织演练；登记每次运维作业出海人员的数量、姓名、出海时间等信息，记录备查。从事风电机组故障、抢修等施工作业的运维船，除基本要求外，还应符合大型起吊设备或者提升机稳性方面的条件；提前24小时向辖区海事管理机构报告出海信息；建立多种应急情况下的应急预案，并定期组织演练；发生安全及污染方面紧急情况时，向海事管理机构与岸基支持部门报告并采取措施。主管机关鼓励对运维船进行体系化管理，提升运维船日常维护养护和安全管理水平。</li>
             <li>运维人员作业时应检查和规范佩戴相关救助、照明、通讯、劳动防护用品，鼓励出海作业配带有定位和报警功能的电子设备；关注航行警告、航行通告等海上安全信息；发现直接危及人身安全的紧急情况时，有权停止运维作业或者采取必要应急措施后撤离现场。</li>
`
      }
    ]
  },
  sbgl: {
    title: '设备管理',
    content: [
      {
        title: '《江苏海事局海上风电通航安全监督管理规定》',
        text: `<li>船舶应当持有法定证书、文书，满足船舶最低安全配员要求，配备相应的救生、消防、通信和防污染等设施设备，在其证书载明的航区内航行、停泊和作业，严格按照核定的船舶种类从事相关作业，不得混作他用。</li>
               <li>非自航船舶应当根据应急需求配备相应的锚、锚链和锚机。</li>
               <li>运维船舶根据安全需要配备登乘软梯等辅助设施。</li>
               <li>所有船舶应当配备船舶自动识别系统，确保随时处于正常工作状态。配齐必要的航海图书资料（非自航船舶除外），正确显示号灯号型，保持甚高频值守。严禁船舶超定额载客、超抗风等级或能见度标准航行。确因特殊情况需要夜间载运人员出海的，应当满足法定夜间航行安全要求。所有船舶不得携带渔网、渔具等与风电施工、运维无关的工具，不得从事捕捞、垂钓、旅游观光等与风电施工、运维无关的作业活动。</li>
`
      },
      {
        title: '《广东海事局海上风电场通航安全监督管理暂行办法》',
        text: `<li>参与海上风电场施工、运维的船舶应当持有有效船舶证书和文书，按照规定配备航海图书资料、相应的救生、消防、通信以及防污染等设施设备，确保处于良好工作状态，并满足船舶最低安全配员要求。起重船、风机安装平台、敷缆船等海上非自航工程船舶应当配备具有一定风电施工经验的持证船员，并确保有足够数量的船员满足航行、作业值班以及应急处置的要求。</li>
               <li>参与海上风电场施工、运维的船舶应当使用符合标准的船用燃油，按规定做好污油（水）、生活污水及船舶垃圾的收集与处置，并做好文书记录。</li>
`
      },
      {
        title: '《山东海事局海上风电通航安全管理办法（暂行）》',
        text: `<li>参与海上风电施工作业的船舶应持有有效船舶证书和文书，按规定配备航海图书资料、相应的救生、消防、通信以及防污染等设施设备，确保处于良好工作状态，并满足船舶最低安全配员要求。</li>
               <li>起重船、风机安装平台、敷缆船等海上非自航工程船舶应当配备具有一定风电施工经验的持证船员，并确保有足够数量的船员满足航行、作业值班以及应急处置的要求。</li>
`
      }
    ]
  },
  xjbh: {
    title: '环境保护',
    content: [
      {
        title: '《中华人民共和国海洋环境保护法》',
        text: `<li>如果海上风电安装船作业过程中可能产生废弃物、污染物等，需要遵守该法中关于海洋环境保护的相关规定，采取措施防止对海洋环境造成污染损害，如按规定处理油污、垃圾等。</li>`
      },
      {
        title: '《防治船舶污染海洋环境管理条例》',
        text: `<li>此条例对船舶在海上航行、停泊、作业过程中的污染防治作出了详细规定，海上风电安装船作业时也需遵守其中关于船舶污染物排放、接收、处理等方面的要求，例如船舶含油污水、生活污水、垃圾等的处理和排放都要符合相应标准和程序，以防止对海洋环境造成污染。</li>`
      },
      {
        title: '《江苏海事局海上风电通航安全监督管理规定》',
        text: `<li>建设、施工、运维单位应当制定海上风电场施工及运维期海洋环境保护方案，落实施工、运维船舶污染物的收集和处置工作，规范船舶、人员行为，防止施工、运维船舶违规排放船舶污染物，确保施工、运维船舶满足《中华人民共和国船舶及其有关作业活动污染海洋环境防治管理规定》有关要求。</li>`
      },
      {
        title: '《国家海洋局关于进一步规范海上风电用海管理的意见》',
        text: `<li>虽然不是专门的环境保护法规，但其中包含了与环境保护相关的内容。例如，在选址方面，强调优先选择在海洋功能区划中已明确兼容风电的功能区布置，避免在各种海洋自然保护区、海洋特别保护区等重要、敏感和脆弱生态区域以及划定的生态红线区内规划布局海上风电场，统筹考虑开发强度和资源环境承载能力等，从用海管理的角度体现了对海洋生态环境保护的要求。</li>`
      }
    ]
  },
  zyxk: {
    title: '作业许可',
    content: [
      {
        title: '《中华人民共和国水上水下作业和活动通航安全管理规定》',
        text: `<li>作业前需向海事管理机构申请水上水下作业许可，提交相关材料，包括作业方案、安全及防污染措施等。明确作业活动的许可条件、申请流程、许可的有效期等内容，以确保作业活动不会对水上交通安全和环境造成不利影响。</li>`
      },
      {
        title: '《江苏海事局海上风电通航安全监督管理规定》',
        text: `<li>海上风电场主体工程、海底缆线完工后，建设单位应当将有关通航安全的技术参数提交海事管理机构进行备案；完成备案后，建设单位应当向海事管理机构申请划定海上风电场安全作业区，并发布航行通告。</li>`
      },
      {
        title: '《广东海事局海上风电场通航安全监督管理暂行办法》',
        text: `<li>海上风电场建设、施工和运维应当按照相关规定办理海上施工作业许可，并落实通航安全保障措施。建设单位应当落实通航安全主体责任，设置相关安全设施并保证其正常有效运行，对施工和运维船舶等实行监控、预警和应急处置等。</li>`
      },
      {
        title: '《广东省海上风电项目管理实施办法》',
        text: `<li>第十三条：海上风电项目在作业时，必须对噪音、振动等产生的环境影响进行监控，确保对周围生态系统和海洋生物的影响在规定范围内。施工期间噪音应符合国家标准，并采取有效的降噪措施。</li>`
      },
      {
        title: '《中华人民共和国安全生产法》',
        text: `<li>海上风电安装船作业单位应建立健全全员安全生产责任制，明确各岗位的安全职责，将安全责任落实到每一个人。例如，船长对船舶的安全航行和作业全面负责，起重机操作员对起重作业的安全负责等。</li>
               <li>制定详细的安全操作规程，涵盖船舶航行、设备操作、人员上下船、货物装卸等各个环节。例如，起重机操作应严格遵守操作规程，确保起重物的稳定和安全；人员上下船应使用安全可靠的登乘设备，并在专人指挥下进行。</li>
               <li>建立完善的应急预案体系，包括火灾、爆炸、人员落水、船舶碰撞、机械故障等各类紧急情况的应急预案。应急预案应定期进行演练，确保作业人员熟悉应急程序和措施。</li>
               <li>对作业场所和设备设施进行定期安全检查，及时发现和消除安全隐患。例如，对船舶的船体结构、机械设备、电气系统等进行检查和维护，确保其处于安全可靠的状态。</li>
               <li>加强对作业人员的安全培训和教育，提高其安全意识和操作技能。新员工应进行入职安全培训，老员工应定期进行安全再培训。培训内容应包括安全法规、操作规程、应急处置等方面。</li>
`
      },
      {
        title: '《江苏海事局海上风电通航安全监督管理规定》',
        text: `<li>作业许可审批流程：
                <div>海上风电场主体工程、海底缆线完工后，建设单位应当将有关通航安全的技术参数提交海事管理机构进行备案。</div>
                <div>完成备案后，建设单位应当向海事管理机构申请划定海上风电场安全作业区，发布航行通告。</div>
               </li>
               <li>特殊作业条件下的要求：
                <div>海上风电场应当与航道、航路、锚地、船舶定线区、船舶报告区、安全作业区等海上交通功能区域保持安全距离。</div>
                <div>海上风电场选址和海底电缆路由应当充分考虑周围通航环境，结合船舶交通流量、特点等进行通航安全专题研究，确定通航安全保障措施。</div>
                <div>海上风电场风机总体布置应当满足施工期船机设备和运维船的通航安全要求。</div>
                <div>海上风电海底电缆管线应当合理设计埋深，不得穿越锚地。电缆管线确需穿越航道、航路、船舶定线区等海上交通功能区域的，应当进行专题研究，采取有效措施，确保通航安全。</div>
                <div>海上风电场应当避免对船舶交通管理系统（VTS）和过往船舶导助航系统造成影响。确实难以避免造成影响的，应当开展专题研究，配备必要的设施以消除不利影响。</div>
                <div>严禁船舶超定额载客、超抗风等级或能见度标准航行。确因特殊情况需要夜间载运人员出海的，应当满足法定夜间航行安全要求。</div>
               </li>
               <li>与当地其他海洋产业协调发展的规定：
                <div>建设、业主（管理）单位应当落实安全生产主体责任，将所有参与施工、运维的单位、船舶和人员纳入管理体系，与其签订安全生产管理协议，对所有船舶实行统一调度。</div>
                <div>施工、运维单位租用和自有的施工、运维船舶应当满足风电场业主单位准入要求，由风电场建设、业主（管理）单位指定或认可，服从风电场建设、业主（管理）单位统一管理。</div>
               </li>
`
      }
    ]
  }
}
useTitle.setSubTitle(data[v].title as unknown as string)
</script>

<style scoped lang="scss"></style>
